{"text": "Planning is my only hope right now. I must write my English essay on Shakespeare by tomorrow evening. The challenge is that the noise from my siblings makes it hard to concentrate. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 80, "TASK"], [81, 100, "DEADLINE"], [124, 179, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must write my English essay on Shakespeare by tomorrow evening. The challenge is that I'm feeling mentally drained today. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 80, "TASK"], [81, 100, "DEADLINE"], [124, 158, "OBSTACLE"]]}
{"text": "This week has been a rollercoaster. Among all the chaos, I still need to study for the biology exam this coming weekend. One major hurdle has been that I'm feeling mentally drained today. Looking back, I realize that when I planned my week better, I managed tasks more smoothly. So, next week, I’ll make a checklist and keep it visible.", "entities": [[73, 99, "TASK"], [100, 119, "DEADLINE"], [152, 186, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must complete my math homework before Friday afternoon. The challenge is that there are family events that are eating into my study time. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 68, "TASK"], [69, 92, "DEADLINE"], [116, 174, "OBSTACLE"]]}
{"text": "This week has been a rollercoaster. Among all the chaos, I still need to complete my math homework in the next two days. One major hurdle has been that there are family events that are eating into my study time. Looking back, I realize that when I planned my week better, I managed tasks more smoothly. So, next week, I’ll make a checklist and keep it visible.", "entities": [[73, 98, "TASK"], [99, 119, "DEADLINE"], [152, 210, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to study for the biology exam before Friday afternoon, yet I can't seem to find the motivation to start. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 65, "TASK"], [66, 89, "DEADLINE"], [95, 139, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to complete my math homework this coming weekend, yet the noise from my siblings makes it hard to concentrate. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 64, "TASK"], [65, 84, "DEADLINE"], [90, 145, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to prepare the slides for my presentation by tomorrow evening, yet I keep getting distracted by my phone notifications. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 77, "TASK"], [78, 97, "DEADLINE"], [103, 154, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to complete my math homework next Monday morning, but there are family events that are eating into my study time. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 72, "TASK"], [73, 92, "DEADLINE"], [98, 156, "OBSTACLE"]]}
{"text": "This week has been a rollercoaster. Among all the chaos, I still need to study for the biology exam by tomorrow evening. One major hurdle has been that I'm feeling mentally drained today. Looking back, I realize that when I planned my week better, I managed tasks more smoothly. So, next week, I’ll make a checklist and keep it visible.", "entities": [[73, 99, "TASK"], [100, 119, "DEADLINE"], [152, 186, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must write my English essay on Shakespeare this coming weekend. The challenge is that the noise from my siblings makes it hard to concentrate. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 80, "TASK"], [81, 100, "DEADLINE"], [124, 179, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to write my English essay on Shakespeare next Monday morning, yet I'm feeling mentally drained today. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 76, "TASK"], [77, 96, "DEADLINE"], [102, 136, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to finish my science project before Friday afternoon, yet the noise from my siblings makes it hard to concentrate. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 64, "TASK"], [65, 88, "DEADLINE"], [94, 149, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to prepare the slides for my presentation in the next two days, but I'm feeling mentally drained today. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 85, "TASK"], [86, 106, "DEADLINE"], [112, 146, "OBSTACLE"]]}
{"text": "This week has been a rollercoaster. Among all the chaos, I still need to finish my science project before Friday afternoon. One major hurdle has been that the noise from my siblings makes it hard to concentrate. Looking back, I realize that when I planned my week better, I managed tasks more smoothly. So, next week, I’ll make a checklist and keep it visible.", "entities": [[73, 98, "TASK"], [99, 122, "DEADLINE"], [155, 210, "OBSTACLE"]]}
{"text": "This week has been a rollercoaster. Among all the chaos, I still need to prepare the slides for my presentation before Friday afternoon. One major hurdle has been that I keep getting distracted by my phone notifications. Looking back, I realize that when I planned my week better, I managed tasks more smoothly. So, next week, I’ll make a checklist and keep it visible.", "entities": [[73, 111, "TASK"], [112, 135, "DEADLINE"], [168, 219, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to finish my science project in the next two days, yet I can't seem to find the motivation to start. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 64, "TASK"], [65, 85, "DEADLINE"], [91, 135, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must study for the biology exam this coming weekend. The challenge is that the noise from my siblings makes it hard to concentrate. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 69, "TASK"], [70, 89, "DEADLINE"], [113, 168, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to complete my math homework this coming weekend, yet I'm feeling mentally drained today. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 64, "TASK"], [65, 84, "DEADLINE"], [90, 124, "OBSTACLE"]]}
{"text": "This week has been a rollercoaster. Among all the chaos, I still need to finish my science project before Friday afternoon. One major hurdle has been that the noise from my siblings makes it hard to concentrate. Looking back, I realize that when I planned my week better, I managed tasks more smoothly. So, next week, I’ll make a checklist and keep it visible.", "entities": [[73, 98, "TASK"], [99, 122, "DEADLINE"], [155, 210, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to write my English essay on Shakespeare by tomorrow evening, but I keep getting distracted by my phone notifications. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 84, "TASK"], [85, 104, "DEADLINE"], [110, 161, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must complete my math homework next Monday morning. The challenge is that the noise from my siblings makes it hard to concentrate. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 68, "TASK"], [69, 88, "DEADLINE"], [112, 167, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to prepare the slides for my presentation next Monday morning, but the noise from my siblings makes it hard to concentrate. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 85, "TASK"], [86, 105, "DEADLINE"], [111, 166, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must finish my science project by tomorrow evening. The challenge is that I'm feeling mentally drained today. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 68, "TASK"], [69, 88, "DEADLINE"], [112, 146, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to complete my math homework before Friday afternoon, yet I'm feeling mentally drained today. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 64, "TASK"], [65, 88, "DEADLINE"], [94, 128, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to finish my science project by tomorrow evening, but I keep getting distracted by my phone notifications. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 72, "TASK"], [73, 92, "DEADLINE"], [98, 149, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to prepare the slides for my presentation before Friday afternoon, yet there are family events that are eating into my study time. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 77, "TASK"], [78, 101, "DEADLINE"], [107, 165, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must prepare the slides for my presentation in the next two days. The challenge is that I can't seem to find the motivation to start. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 81, "TASK"], [82, 102, "DEADLINE"], [126, 170, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to finish my science project by tomorrow evening, yet I can't seem to find the motivation to start. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 64, "TASK"], [65, 84, "DEADLINE"], [90, 134, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to finish my science project by tomorrow evening, but I'm feeling mentally drained today. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 72, "TASK"], [73, 92, "DEADLINE"], [98, 132, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must study for the biology exam in the next two days. The challenge is that I can't seem to find the motivation to start. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 69, "TASK"], [70, 90, "DEADLINE"], [114, 158, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to write my English essay on Shakespeare this coming weekend, but I keep getting distracted by my phone notifications. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 84, "TASK"], [85, 104, "DEADLINE"], [110, 161, "OBSTACLE"]]}
{"text": "This week has been a rollercoaster. Among all the chaos, I still need to study for the biology exam this coming weekend. One major hurdle has been that I can't seem to find the motivation to start. Looking back, I realize that when I planned my week better, I managed tasks more smoothly. So, next week, I’ll make a checklist and keep it visible.", "entities": [[73, 99, "TASK"], [100, 119, "DEADLINE"], [152, 196, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must study for the biology exam in the next two days. The challenge is that I keep getting distracted by my phone notifications. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 69, "TASK"], [70, 90, "DEADLINE"], [114, 165, "OBSTACLE"]]}
{"text": "This week has been a rollercoaster. Among all the chaos, I still need to write my English essay on Shakespeare in the next two days. One major hurdle has been that I keep getting distracted by my phone notifications. Looking back, I realize that when I planned my week better, I managed tasks more smoothly. So, next week, I’ll make a checklist and keep it visible.", "entities": [[73, 110, "TASK"], [111, 131, "DEADLINE"], [164, 215, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to study for the biology exam this coming weekend, yet I'm feeling mentally drained today. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 65, "TASK"], [66, 85, "DEADLINE"], [91, 125, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to finish my science project in the next two days, yet there are family events that are eating into my study time. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 64, "TASK"], [65, 85, "DEADLINE"], [91, 149, "OBSTACLE"]]}
{"text": "This week has been a rollercoaster. Among all the chaos, I still need to write my English essay on Shakespeare next Monday morning. One major hurdle has been that the noise from my siblings makes it hard to concentrate. Looking back, I realize that when I planned my week better, I managed tasks more smoothly. So, next week, I’ll make a checklist and keep it visible.", "entities": [[73, 110, "TASK"], [111, 130, "DEADLINE"], [163, 218, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to complete my math homework before Friday afternoon, but I'm feeling mentally drained today. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 72, "TASK"], [73, 96, "DEADLINE"], [102, 136, "OBSTACLE"]]}
{"text": "This week has been a rollercoaster. Among all the chaos, I still need to prepare the slides for my presentation before Friday afternoon. One major hurdle has been that I keep getting distracted by my phone notifications. Looking back, I realize that when I planned my week better, I managed tasks more smoothly. So, next week, I’ll make a checklist and keep it visible.", "entities": [[73, 111, "TASK"], [112, 135, "DEADLINE"], [168, 219, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to finish my science project before Friday afternoon, but I keep getting distracted by my phone notifications. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 72, "TASK"], [73, 96, "DEADLINE"], [102, 153, "OBSTACLE"]]}
{"text": "This week has been a rollercoaster. Among all the chaos, I still need to write my English essay on Shakespeare next Monday morning. One major hurdle has been that I can't seem to find the motivation to start. Looking back, I realize that when I planned my week better, I managed tasks more smoothly. So, next week, I’ll make a checklist and keep it visible.", "entities": [[73, 110, "TASK"], [111, 130, "DEADLINE"], [163, 207, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must prepare the slides for my presentation next Monday morning. The challenge is that I keep getting distracted by my phone notifications. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 81, "TASK"], [82, 101, "DEADLINE"], [125, 176, "OBSTACLE"]]}
{"text": "This week has been a rollercoaster. Among all the chaos, I still need to finish my science project before Friday afternoon. One major hurdle has been that I keep getting distracted by my phone notifications. Looking back, I realize that when I planned my week better, I managed tasks more smoothly. So, next week, I’ll make a checklist and keep it visible.", "entities": [[73, 98, "TASK"], [99, 122, "DEADLINE"], [155, 206, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to complete my math homework in the next two days, yet I'm feeling mentally drained today. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 64, "TASK"], [65, 85, "DEADLINE"], [91, 125, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must write my English essay on Shakespeare before Friday afternoon. The challenge is that I can't seem to find the motivation to start. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 80, "TASK"], [81, 104, "DEADLINE"], [128, 172, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to write my English essay on Shakespeare by tomorrow evening, but I keep getting distracted by my phone notifications. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 84, "TASK"], [85, 104, "DEADLINE"], [110, 161, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to write my English essay on Shakespeare by tomorrow evening, yet I'm feeling mentally drained today. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 76, "TASK"], [77, 96, "DEADLINE"], [102, 136, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to study for the biology exam before Friday afternoon, but I keep getting distracted by my phone notifications. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 73, "TASK"], [74, 97, "DEADLINE"], [103, 154, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must write my English essay on Shakespeare in the next two days. The challenge is that I can't seem to find the motivation to start. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 80, "TASK"], [81, 101, "DEADLINE"], [125, 169, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must prepare the slides for my presentation next Monday morning. The challenge is that the noise from my siblings makes it hard to concentrate. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 81, "TASK"], [82, 101, "DEADLINE"], [125, 180, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to complete my math homework before Friday afternoon, yet I keep getting distracted by my phone notifications. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 64, "TASK"], [65, 88, "DEADLINE"], [94, 145, "OBSTACLE"]]}
{"text": "This week has been a rollercoaster. Among all the chaos, I still need to write my English essay on Shakespeare this coming weekend. One major hurdle has been that I can't seem to find the motivation to start. Looking back, I realize that when I planned my week better, I managed tasks more smoothly. So, next week, I’ll make a checklist and keep it visible.", "entities": [[73, 110, "TASK"], [111, 130, "DEADLINE"], [163, 207, "OBSTACLE"]]}
{"text": "This week has been a rollercoaster. Among all the chaos, I still need to prepare the slides for my presentation next Monday morning. One major hurdle has been that I'm feeling mentally drained today. Looking back, I realize that when I planned my week better, I managed tasks more smoothly. So, next week, I’ll make a checklist and keep it visible.", "entities": [[73, 111, "TASK"], [112, 131, "DEADLINE"], [164, 198, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must complete my math homework in the next two days. The challenge is that I can't seem to find the motivation to start. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 68, "TASK"], [69, 89, "DEADLINE"], [113, 157, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to finish my science project this coming weekend, but there are family events that are eating into my study time. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 72, "TASK"], [73, 92, "DEADLINE"], [98, 156, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must write my English essay on Shakespeare before Friday afternoon. The challenge is that I can't seem to find the motivation to start. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 80, "TASK"], [81, 104, "DEADLINE"], [128, 172, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must complete my math homework before Friday afternoon. The challenge is that I keep getting distracted by my phone notifications. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 68, "TASK"], [69, 92, "DEADLINE"], [116, 167, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to prepare the slides for my presentation in the next two days, but I'm feeling mentally drained today. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 85, "TASK"], [86, 106, "DEADLINE"], [112, 146, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must write my English essay on Shakespeare this coming weekend. The challenge is that I keep getting distracted by my phone notifications. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 80, "TASK"], [81, 100, "DEADLINE"], [124, 175, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to complete my math homework in the next two days, yet I'm feeling mentally drained today. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 64, "TASK"], [65, 85, "DEADLINE"], [91, 125, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to study for the biology exam this coming weekend, but there are family events that are eating into my study time. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 73, "TASK"], [74, 93, "DEADLINE"], [99, 157, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must finish my science project next Monday morning. The challenge is that I keep getting distracted by my phone notifications. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 68, "TASK"], [69, 88, "DEADLINE"], [112, 163, "OBSTACLE"]]}
{"text": "This week has been a rollercoaster. Among all the chaos, I still need to prepare the slides for my presentation next Monday morning. One major hurdle has been that I can't seem to find the motivation to start. Looking back, I realize that when I planned my week better, I managed tasks more smoothly. So, next week, I’ll make a checklist and keep it visible.", "entities": [[73, 111, "TASK"], [112, 131, "DEADLINE"], [164, 208, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must complete my math homework by tomorrow evening. The challenge is that the noise from my siblings makes it hard to concentrate. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 68, "TASK"], [69, 88, "DEADLINE"], [112, 167, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to complete my math homework this coming weekend, yet I'm feeling mentally drained today. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 64, "TASK"], [65, 84, "DEADLINE"], [90, 124, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must prepare the slides for my presentation before Friday afternoon. The challenge is that I'm feeling mentally drained today. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 81, "TASK"], [82, 105, "DEADLINE"], [129, 163, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to finish my science project this coming weekend, yet there are family events that are eating into my study time. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 64, "TASK"], [65, 84, "DEADLINE"], [90, 148, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must write my English essay on Shakespeare next Monday morning. The challenge is that I'm feeling mentally drained today. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 80, "TASK"], [81, 100, "DEADLINE"], [124, 158, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to prepare the slides for my presentation before Friday afternoon, but I keep getting distracted by my phone notifications. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 85, "TASK"], [86, 109, "DEADLINE"], [115, 166, "OBSTACLE"]]}
{"text": "This week has been a rollercoaster. Among all the chaos, I still need to finish my science project in the next two days. One major hurdle has been that I'm feeling mentally drained today. Looking back, I realize that when I planned my week better, I managed tasks more smoothly. So, next week, I’ll make a checklist and keep it visible.", "entities": [[73, 98, "TASK"], [99, 119, "DEADLINE"], [152, 186, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must write my English essay on Shakespeare next Monday morning. The challenge is that there are family events that are eating into my study time. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 80, "TASK"], [81, 100, "DEADLINE"], [124, 182, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must prepare the slides for my presentation in the next two days. The challenge is that I can't seem to find the motivation to start. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 81, "TASK"], [82, 102, "DEADLINE"], [126, 170, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must complete my math homework before Friday afternoon. The challenge is that I can't seem to find the motivation to start. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 68, "TASK"], [69, 92, "DEADLINE"], [116, 160, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to prepare the slides for my presentation in the next two days, but I keep getting distracted by my phone notifications. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 85, "TASK"], [86, 106, "DEADLINE"], [112, 163, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to prepare the slides for my presentation next Monday morning, yet there are family events that are eating into my study time. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 77, "TASK"], [78, 97, "DEADLINE"], [103, 161, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to finish my science project in the next two days, yet I keep getting distracted by my phone notifications. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 64, "TASK"], [65, 85, "DEADLINE"], [91, 142, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to prepare the slides for my presentation before Friday afternoon, yet there are family events that are eating into my study time. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 77, "TASK"], [78, 101, "DEADLINE"], [107, 165, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to study for the biology exam by tomorrow evening, but the noise from my siblings makes it hard to concentrate. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 73, "TASK"], [74, 93, "DEADLINE"], [99, 154, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to study for the biology exam by tomorrow evening, but the noise from my siblings makes it hard to concentrate. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 73, "TASK"], [74, 93, "DEADLINE"], [99, 154, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to finish my science project next Monday morning, but I keep getting distracted by my phone notifications. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 72, "TASK"], [73, 92, "DEADLINE"], [98, 149, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to write my English essay on Shakespeare before Friday afternoon, yet I keep getting distracted by my phone notifications. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 76, "TASK"], [77, 100, "DEADLINE"], [106, 157, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must study for the biology exam by tomorrow evening. The challenge is that the noise from my siblings makes it hard to concentrate. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 69, "TASK"], [70, 89, "DEADLINE"], [113, 168, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to prepare the slides for my presentation next Monday morning, yet I can't seem to find the motivation to start. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 77, "TASK"], [78, 97, "DEADLINE"], [103, 147, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must complete my math homework by tomorrow evening. The challenge is that there are family events that are eating into my study time. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 68, "TASK"], [69, 88, "DEADLINE"], [112, 170, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must write my English essay on Shakespeare next Monday morning. The challenge is that I can't seem to find the motivation to start. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 80, "TASK"], [81, 100, "DEADLINE"], [124, 168, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to prepare the slides for my presentation in the next two days, but I'm feeling mentally drained today. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 85, "TASK"], [86, 106, "DEADLINE"], [112, 146, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to finish my science project by tomorrow evening, but I keep getting distracted by my phone notifications. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 72, "TASK"], [73, 92, "DEADLINE"], [98, 149, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to study for the biology exam before Friday afternoon, but I'm feeling mentally drained today. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 73, "TASK"], [74, 97, "DEADLINE"], [103, 137, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to complete my math homework this coming weekend, yet I keep getting distracted by my phone notifications. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 64, "TASK"], [65, 84, "DEADLINE"], [90, 141, "OBSTACLE"]]}
{"text": "I'm so frustrated! I’ve been trying to prepare the slides for my presentation this coming weekend, yet I'm feeling mentally drained today. It's like no matter how hard I try, things keep getting in my way. I'm exhausted, and I just wish people understood how hard it is to stay on track.", "entities": [[39, 77, "TASK"], [78, 97, "DEADLINE"], [103, 137, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must prepare the slides for my presentation next Monday morning. The challenge is that there are family events that are eating into my study time. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 81, "TASK"], [82, 101, "DEADLINE"], [125, 183, "OBSTACLE"]]}
{"text": "This week has been a rollercoaster. Among all the chaos, I still need to complete my math homework in the next two days. One major hurdle has been that I can't seem to find the motivation to start. Looking back, I realize that when I planned my week better, I managed tasks more smoothly. So, next week, I’ll make a checklist and keep it visible.", "entities": [[73, 98, "TASK"], [99, 119, "DEADLINE"], [152, 196, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to study for the biology exam this coming weekend, but I'm feeling mentally drained today. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 73, "TASK"], [74, 93, "DEADLINE"], [99, 133, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to write my English essay on Shakespeare before Friday afternoon, but I keep getting distracted by my phone notifications. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 84, "TASK"], [85, 108, "DEADLINE"], [114, 165, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must complete my math homework in the next two days. The challenge is that I'm feeling mentally drained today. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 68, "TASK"], [69, 89, "DEADLINE"], [113, 147, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must finish my science project before Friday afternoon. The challenge is that I'm feeling mentally drained today. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 68, "TASK"], [69, 92, "DEADLINE"], [116, 150, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to study for the biology exam this coming weekend, but I'm feeling mentally drained today. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 73, "TASK"], [74, 93, "DEADLINE"], [99, 133, "OBSTACLE"]]}
{"text": "Planning is my only hope right now. I must prepare the slides for my presentation by tomorrow evening. The challenge is that the noise from my siblings makes it hard to concentrate. I’ll try breaking it down into smaller chunks and maybe set a timer to stay focused. If I can manage to avoid distractions for even 20 minutes, it’ll be progress.", "entities": [[43, 81, "TASK"], [82, 101, "DEADLINE"], [125, 180, "OBSTACLE"]]}
{"text": "I woke up feeling overwhelmed today. I have to finish my science project this coming weekend, but I keep getting distracted by my phone notifications. Every time I try to focus, something pulls me away. It's so frustrating because I really want to get this done, but my brain just won’t cooperate.", "entities": [[47, 72, "TASK"], [73, 92, "DEADLINE"], [98, 149, "OBSTACLE"]]}